Revit 2025 API
HiddenLineViewsType Enumeration
 An enumerated type listing all Hidden Line Views types of Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum HiddenLineViewsType
Public Enumeration HiddenLineViewsType
public enum class HiddenLineViewsType
type HiddenLineViewsType
Members
Member name | Value | Description
VectorProcessing | 0 |  The type of Hidden Line Views is Vector Processing (fast).
RasterProcessing | 1 |  The type of Hidden Line Views is Raster Processing.
See Also
Reference
Autodesk.Revit.DB Namespace